<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","backend":"12c7541683cf7ec33f914d3128af159054ce0d5e6e9774d4100d4afede302aff","plan_job_ref":"Job Plan Terraform #18 at https://github.com/Decatur-Robotics/Gearbox-Terraform/actions/runs/13189244511","plan_out_hash":"f11b8cab4b14486554ff98e380caec62b543295ee96589dd1763b6c98c5e60a6","plan_hash":"ce02302caa92ad8ff4672769b1b8c90800f33041415981bc82c22e3fb85855d2","plan_text_format":"diff","version":"1.46.1"} -->
Terraform plan in __.__
<details>
<summary>Plan: 0 to add, 1 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # cloudflare_dns_record.status-cname will be updated in-place
!~  resource "cloudflare_dns_record" "status-cname" {
+       comment             = (known after apply)
+       comment_modified_on = (known after apply)
!~      content             = "gearbox-980962066.us-east-1.elb.amazonaws.com" -> "app.pulsetic.com"
!~      created_on          = "2025-02-03T22:20:13Z" -> (known after apply)
+       data                = (known after apply)
        id                  = "8414401feaf9313a5eea18d32c031a8e"
!~      meta                = jsonencode({}) -> (known after apply)
!~      modified_on         = "2025-02-06T22:28:41Z" -> (known after apply)
        name                = "status"
!~      proxiable           = true -> (known after apply)
!~      settings            = {
!~          flatten_cname = false -> (known after apply)
+           ipv4_only     = (known after apply)
+           ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
+       tags_modified_on    = (known after apply)
#        (4 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform #18](https://github.com/Decatur-Robotics/Gearbox-Terraform/actions/runs/13189244511)